Repository: ruchiservapp-dot/Ruchiserv
Catalog: lib/l10n/app_*.arb
Languages: hi, ta, te

# signInContinue
source: Sign in to continue
hi: जारी रखने के लिए साइन इन करें
ta: தொடர உள்நுழையவும்
te: కొనసాగడానికి సైన్ ఇన్ చేయండి

source: Firm ID
hi: फर्म आईडी
ta: நிறுவன ஐடி
te: సంస్థ ID

source: Enter firm ID
hi: फर्म आईडी दर्ज करें
ta: நிறுவன ஐடியை உள்ளிடவும்
te: సంస్థ ID ని నమోదు చేయండి

source: Mobile Number
hi: मोबाइल नंबर
ta: மொபைல் எண்
te: మొబైల్ నంబర్

source: Enter mobile
hi: मोबाइल नंबर दर्ज करें
ta: மொபைல் எண்ணை உள்ளிடவும்
te: మొబైల్ నంబర్ నమోదు చేయండి

source: Password
hi: पासवर्ड
ta: கடவுச்சொல்
te: పాస్‌వర్డ్

source: Enter password
hi: पासवर्ड दर्ज करें
ta: கடவுச்சொல்லை உள்ளிடவும்
te: పాస్‌వర్డ్ నమోదు చేయండి

# loginButton
source: LOGIN
hi: लॉगिन
ta: உள்நுழை
te: లాగిన్

source: Enable Biometric Login
hi: बायोमेट्रिक लॉगिन सक्षम करें
ta: பயோமெட்ரிக் உள்நுழைவை இயக்கு
te: బయోమెట్రిక్ లాగిన్‌ని ప్రారంభించు

# enableBiometricPrompt
source: Would you like to enable biometric authentication for faster login next time?
hi: क्या आप अगली बार तेज़ लॉगिन के लिए बायोमेट्रिक प्रमाणीकरण सक्षम करना चाहेंगे?
ta: அடுத்த முறை விரைவாக உள்நுழைய பயோமெட்ரிக் அங்கீகாரத்தைப் பயன்படுத்த விரும்புகிறீர்களா?
te: తదుపరి సారి వేగంగా లాగిన్ కావడానికి బయోమెట్రిక్ ప్రమాణీకరణను ఉపయోగించాలనుకుంటున్నారా?

source: Not Now
hi: अभी नहीं
ta: இப்போது இல்லை
te: ఇప్పుడు వద్దు

source: Enable
hi: सक्षम करें
ta: இயக்கு
te: ప్రారంభించు

# biometricEnabled
source: Biometric login enabled!
hi: बायोमेट्रिक लॉगिन सक्षम!
ta: பயோமெட்ரிக் உள்நுழைவு இயக்கப்பட்டது!
te: బయోమెట్రిక్ లాగిన్ ప్రారంభించబడింది!

# failedEnableBiometric
source: Failed to enable biometrics: {error}
hi: बायोमेट्रिक्स सक्षम करने में विफल: {error}
ta: பயோமெட்ரிக்கை இயக்குவதில் தோல்வி: {error}
te: బయోమెట్రిక్ ప్రారంభించడంలో విఫలమైంది: {error}

# biometricNotAllowed
source: Biometric login not allowed. Please login online once.
hi: बायोमेट्रिक लॉगिन की अनुमति नहीं है। कृपया ऑनलाइन लॉगिन करें।
ta: பயோமெட்ரிக் உள்நுழைவு அனுமதிக்கப்படவில்லை. ஆன்லைனில் உள்நுழையவும்.
te: బయోమెట్రిక్ లాగిన్ అనుమతించబడదు. దయచేసి ఆన్‌లైన్‌లో లాగిన్ చేయండి.

# biometricFailed
source: Biometric failed: {error}
hi: बायोमेट्रिक विफल: {error}
ta: பயோமெட்ரிக் தோல்வியடைந்தது: {error}
te: బయోమెట్రిక్ విఫలమైంది: {error}

source: Subscription
hi: सदस्यता
ta: சந்தா
te: సభ్యత్వం

# subscriptionExpired
source: Your subscription has expired. Please renew to continue.
hi: आपकी सदस्यता समाप्त हो गई है। जारी रखने के लिए कृपया नवीनीकृत करें।
ta: உங்கள் சந்தா காலாவதியாகிவிட்டது. தொடர புதுப்பிக்கவும்.
te: మీ సభ్యత్వం గడువు ముగిసింది. కొనసాగడానికి దయచేసి పునరుద్ధరించండి.

# subscriptionExpiresIn
source: Your subscription expires in {days} day(s). Please renew.
hi: किरप्या नवीनीकृत करें। आपकी सदस्यता {days} दिन(नों) में समाप्त हो जाएगी।
ta: உங்கள் சந்தா {days} நாட்களில் காலாவதியாகிறது. தயவுசெய்து புதுப்பிக்கவும்.
te: మీ సభ్యత్వం {days} రోజుల్లో ముగుస్తుంది. దయచేసి పునరుద్ధరించండి.

source: OK
hi: ठीक है
ta: சரி
te: సరే

# loginError
source: Login error: {error}
hi: लॉगिन त्रुटि: {error}
ta: உள்நுழைவு பிழை: {error}
te: లాగిన్ లోపం: {error}

source: Register
hi: रजिस्टर
ta: பதிவு
te: రిజిస్టర్

source: Forgot password?
hi: पासवर्ड भूल गए?
ta: கடவுச்சொல் மறந்துவிட்டதா?
te: పాస్‌వర్డ్ మర్చిపోయారా?

source: Invalid credentials.
hi: अमान्य क्रेडेंशियल्स।
ta: தவறான தகவல்கள்.
te: తప్పు వివరాలు.

# offlineLoginNotAllowed
source: Offline login not allowed. Please connect to the internet.
hi: ऑफ़लाइन लॉगिन की अनुमति नहीं है। कृपया इंटरनेट से कनेक्ट करें।
ta: ஆஃப்லைன் உள்நுழைவு அனுமதிக்கப்படவில்லை. இணையத்துடன் இணைக்கவும்.
te: ఆఫ్‌లైన్ లాగిన్ అనుమతించబడదు. దయచేసి ఇంటర్నెట్‌కు కనెక్ట్ చేయండి.

# mainMenuTitle
source: Menu
hi: मेनू
ta: மெனு
te: మెనూ

# moduleOrders
source: Orders
hi: ऑर्डर
ta: ஆர்டர்கள்
te: ఆర్డర్లు

# moduleOperations
source: Operations
hi: संचालन
ta: செயல்பாடுகள்
te: కార్యకలాపాలు

# moduleInventory
source: Inventory
hi: इन्वेंट्री
ta: சரக்கு
te: ఇన్వెంటరీ

# moduleFinance
source: Finance
hi: वित्त
ta: நிதி
te: ఆర్థిక

# moduleReports
source: Reports
hi: रिपोर्ट
ta: அறிக்கைகள்
te: నివేదికలు

# moduleSettings
source: Settings
hi: सेटिंग्स
ta: அமைப்புகள்
te: సెట్టింగ్‌లు

# moduleAttendance
source: My Attendance
hi: मेरी उपस्थिति
ta: வருகை பதிவு
te: నా హాజరు

source: No modules available
hi: कोई मॉड्यूल उपलब्ध नहीं
ta: தொகுதிகள் இல்லை
te: మాడ్యూల్స్ అందుబాటులో లేవు

# contactAdministrator
source: Contact your administrator
hi: प्रशासक से संपर्क करें
ta: நிர்வாகியைத் தொடர்பு கொள்ளவும்
te: అడ్మినిస్ట్రేటర్‌ను సంప్రదించండి

source: Firm Profile
hi: फर्म प्रोफाइल
ta: நிறுவன விவரம்
te: సంస్థ ప్రొఫైల్

# viewUpdateFirm
source: View or update your firm details
hi: विवरण देखें या अपडेट करें
ta: விவரங்களைப் பார்க்கவும்/புதுப்பிக்கவும்
te: వివరాలను వీక్షించండి/నవీకరించండి

source: User Profile
hi: उपयोगकर्ता प्रोफाइल
ta: பயனர் விவரம்
te: వినియోగదారు ప్రొఫైల్

# manageLoginPrefs
source: Manage your login and preferences
hi: लॉगिन प्राथमिकताएं प्रबंधित करें
ta: உள்நுழைவு விருப்பங்களை நிர்வகிக்கவும்
te: లాగిన్ ప్రాధాన్యతలను నిర్వహించండి

source: Manage Users
hi: उपयोगकर्ता प्रबंधित करें
ta: பயனர்கள்
te: వినియోగదారులను నిర్వహించండి

# manageUsersSubtitle
source: Add users and set permissions
hi: उपयोगकर्ता जोड़ें और अनुमतियां सेट करें
ta: பயனர்களைச் சேர்க்கவும்
te: వినియోగదారులను జోడించండి

# authMobiles
source: Authorized Mobiles
hi: अधिकृत मोबाइल
ta: அங்கீகரிக்கப்பட்ட எண்கள்
te: అధీకృత మొబైల్స్

# authMobilesSubtitle
source: Manage pre-approved mobile numbers
hi: मोबाइल नंबर प्रबंधित करें
ta: மொபைல் எண்களை நிர்வகிக்கவும்
te: మొబైల్ నంబర్లను నిర్వహించండి

source: Payment Settings
hi: भुगतान सेटिंग्स
ta: கட்டண அமைப்புகள்
te: చెల్లింపు సెట్టింగ్‌లు

# paymentSettingsSubtitle
source: Configure payment gateways
hi: गेटवे कॉन्फ़िगर करें
ta: கட்டண நுழைவாயில்கள்
te: గేట్‌వేలను కాన్ఫిగర్ చేయండి

source: General Settings
hi: सामान्य सेटिंग्स
ta: பொது அமைப்புகள்
te: సాధారణ సెట్టింగ్‌లు

# generalSettingsSubtitle
source: Theme, Notifications, Security
hi: थीम, सूचनाएं, सुरक्षा
ta: தீம், பாதுகாப்பு
te: థీమ్, భద్రత

source: Vehicle Master
hi: वाहन
ta: வாகனங்கள்
te: వాహనాలు

# vehicleMasterSubtitle
source: Manage fleet vehicles
hi: वाहन प्रबंधित करें
ta: வாகனங்களை நிர்வகிக்கவும்
te: వాహనాలను నిర్వహించండి

source: Utensil Master
hi: बर्तन
ta: பாத்திரங்கள்
te: పాత్రలు

# utensilMasterSubtitle
source: Manage utensils & consumables
hi: बर्तन प्रबंधित करें
ta: பாத்திரங்களை நிர்வகிக்கவும்
te: పాత్రలను నిర్వహించండి

# backupAWS
source: Backup to AWS
hi: AWS बैकअप
ta: AWS காப்புப் பிரதி
te: AWS బ్యాకప్

# backupSubtitle
source: Upload all data to cloud
hi: क्लाउड पर अपलोड करें
ta: மேகக்கணிக்கு பதிவேற்றவும்
te: క్లౌడ్‌కు అప్‌లోడ్ చేయండి

source: Audit Logs
hi: ऑडिट लॉग
ta: தணிக்கை பதிவுகள்
te: ఆడిట్ లాగ్స్

# auditLogsSubtitle
source: View and export compliance logs
hi: लॉग देखें
ta: இணக்கப் பதிவுகள்
te: లాగ్‌లను చూడండి

# aboutApp
source: About RuchiServ
hi: ऐप के बारे में
ta: பற்றி
te: యాప్ గురించి

source: Logout
hi: लॉगआउट
ta: வெளியேறு
te: లాగౌట్

source: Select Language
hi: भाषा चुनें
ta: மொழியைத் தேர்ந்தெடுக்கவும்
te: భాషను ఎంచుకోండి

# attendanceTitle
source: My Attendance
hi: मेरी उपस्थिति
ta: என் வருகை பதிவு
te: నా హాజరు

# noStaffRecord
source: No Staff Record Found
hi: कोई स्टाफ रिकॉर्ड नहीं मिला
ta: ஊழியர் பதிவு இல்லை
te: స్టాఫ్ రికార్డ్ కనుగొనబడలేదు

# mobileNotLinked
source: Your mobile number is not linked to any staff record. Please contact your administrator.
hi: आपका मोबाइल नंबर किसी स्टाफ रिकॉर्ड से लिंक नहीं है। कृपया प्रशासक से संपर्क करें।
ta: உங்கள் மொபைல் எண் எந்த ஊழியர் பதிவுடனும் இணைக்கப்படவில்லை. நிர்வாகியைத் தொடர்பு கொள்ளவும்.
te: మీ మొబైల్ నంబర్ ఏ స్టాఫ్ రికార్డ్‌తో లింక్ చేయబడలేదు. దయచేసి అడ్మినిస్ట్రేటర్‌ను సంప్రదించండి.

source: Checking location...
hi: स्थान की जाँच की जा रही है...
ta: இடத்தைச் சரிபார்க்கிறது...
te: స్థానాన్ని తనిఖీ చేస్తోంది...

source: PUNCH IN
hi: पंच इन
ta: பஞ்ச் இன்
te: పంచ్ ఇన్

source: PUNCH OUT
hi: पंच आउट
ta: பஞ்ச் அவுட்
te: పంచ్ అవుట్

source: Punching...
hi: पंचिंग...
ta: பதிவு செய்கிறது...
te: నమోదు చేస్తోంది...

source: Ready to Punch In
hi: पंच इन के लिए तैयार
ta: பஞ்ச் இன் செய்யத் தயார்
te: పంచ్ ఇన్ చేయడానికి సిద్ధం

# workingSince
source: Working since {time}
hi: {time} से काम कर रहे हैं
ta: {time} முதல் வேலை செய்கிறீர்கள்
te: {time} నుండి పని చేస్తున్నారు

# todayShiftCompleted
source: Today's Shift Completed
hi: आज की शिफ्ट पूरी हुई
ta: இன்றைய ஷிப்ட் முடிந்தது
te: ఈ రోజు షిఫ్ట్ పూర్తయింది

# elapsedTime
source: {hours}h {minutes}m elapsed
hi: {hours} घंटे {minutes} मिनट बीते
ta: {hours} மணி {minutes} நிமிடம் முடிந்தது
te: {hours} గంటలు {minutes} నిమిషాలు గడిచాయి

# todayDetails
source: Today's Details
hi: आज का विवरण
ta: இன்றைய விவரங்கள்
te: ఈ రోజు వివరాలు

source: Punched In
hi: पंच इन किया गया
ta: பஞ்ச் இன் செய்யப்பட்டது
te: పంచ్ ఇన్ చేశారు

source: Punched Out
hi: पंच आउट किया गया
ta: பஞ்ச் அவுட் செய்யப்பட்டது
te: పంచ్ అవుట్ చేశారు

source: Location
hi: स्थान
ta: இடம்
te: స్థానం

# withinKitchen
source: Within Kitchen Area
hi: रसोई क्षेत्र के भीतर
ta: சமையலறை எல்லைக்குள்
te: కిచెన్ పరిధిలో

# outsideKitchen
source: Outside Kitchen Area
hi: रसोई क्षेत्र के बाहर
ta: சமையலறைக்கு வெளியே
te: కిచెన్ వెలుపల

# punchSuccess
source: ✅ Punched In Successfully!
hi: ✅ सफलतापूर्वक पंच इन किया गया!
ta: ✅ வெற்றிகரமாக பஞ்ச் இன் செய்யப்பட்டது!
te: ✅ విజయవంతంగా పంచ్ ఇన్ చేశారు!

# punchWarning
source: ⚠️ Punched In (Outside Kitchen Area)
hi: ⚠️ पंच इन किया गया (रसोई क्षेत्र के बाहर)
ta: ⚠️ பஞ்ச் இன் செய்யப்பட்டது (சமையலறைக்கு வெளியே)
te: ⚠️ పంచ్ ఇన్ చేశారు (కిచెన్ వెలుపల)

# punchOutSuccess
source: ✅ Punched Out - {hours} hours
hi: ✅ पंच आउट किया गया - {hours} घंटे
ta: ✅ பஞ்ச் அவுட் செய்யப்பட்டது - {hours} மணிநேரம்
te: ✅ పంచ్ అవుట్ చేశారు - {hours} గంటలు

source: Refresh
hi: ताज़ा करें
ta: புதுப்பி
te: రీఫ్రెష్

source: Loading...
hi: लोड हो रहा है...
ta: ஏற்றுகிறது...
te: లోడ్ అవుతోంది...

# ordersCalendarTitle
source: Orders Calendar
hi: ऑर्डर कैलेंडर
ta: ஆர்டர் காலண்டர்
te: ఆర్డర్ క్యాలెండర్

source: Open System Calendar
hi: सिस्टम कैलेंडर खोलें
ta: சிஸ்டம் காலண்டரைத் திற
te: సిస్టమ్ క్యాలెండర్ తెరవండి

# utilizationLow
source: Low (<50%)
hi: कम (<50%)
ta: குறைவு (<50%)
te: తక్కువ (<50%)

# utilizationMed
source: Med (50-90%)
hi: मध्यम (50-90%)
ta: நடுத்தரம் (50-90%)
te: మధ్యస్థం (50-90%)

# utilizationHigh
source: High (>90%)
hi: उच्च (>90%)
ta: அதிகம் (>90%)
te: అధికం (>90%)

source: Edit Order
hi: ऑर्डर संपादित करें
ta: ஆர்டரைத் திருத்து
te: ఆర్డర్ సవరించండి

source: Add Order
hi: ऑर्डर जोड़ें
ta: ஆர்டரைச் சேர்
te: ఆర్డర్ జోడించు

# dateLabel
source: Date
hi: तारीख
ta: தேதி
te: తేదీ

# totalPax
source: Total Pax: {pax}
hi: कुल पैक्स: {pax}
ta: மொத்த நபர்கள்: {pax}
te: మొత్తం వ్యక్తులు: {pax}

source: Delivery Time
hi: डिलीवरी का समय
ta: டெலிவரி நேரம்
te: డెలివరీ సమయం

source: Tap to select time
hi: समय चुनने के लिए टैप करें
ta: நேரத்தைத் தேர்ந்தெடுக்க தட்டவும்
te: సమయం ఎంచుకోవడానికి నొక్కండి

source: Customer Name
hi: ग्राहक का नाम
ta: வாடிக்கையாளர் பெயர்
te: కస్టమర్ పేరు

source: Digits only
hi: केवल अंक
ta: எண்கள் மட்டும்
te: అంకెలు మాత్రమే

# mobileLengthError
source: Must be exactly 10 digits
hi: ठीक 10 अंक होने चाहिए
ta: சரியாக 10 இலக்கங்கள் இருக்க வேண்டும்
te: ఖచ్చితంగా 10 అంకెలు ఉండాలి

source: Meal Type
hi: भोजन का प्रकार
ta: உணவு வகை
te: భోజనం రకం

source: Food Type
hi: खाद्य प्रकार
ta: உணவு
te: ఆహారం రకం

source: Menu Items
hi: मेनू आइटम
ta: மெனு உருப்படிகள்
te: మెనూ అంశాలు

source: Add Item
hi: आइटम जोड़ें
ta: உருப்படியைச் சேர்
te: అంశం జోడించు

source: Subtotal (₹)
hi: उपयोग (₹)
ta: மொத்தம் (₹)
te: మొత్తం (₹)

# discPercent
source: Disc %
hi: छूट %
ta: தள்ளுபடி %
te: రిబేటు %

source: Dish Total:
hi: डिश कुल:
ta: உணவு மொத்தம்:
te: డిష్ మొత్తం:

# serviceAndCounterSetup
source: Service & Counter Setup
hi: सेवा और काउंटर सेटअप
ta: சேவை & கவுண்டர் அமைப்பு
te: సర్వీస్ & కౌంటర్ సెటప్

# serviceRequiredQuestion
source: Service Required?
hi: क्या सेवा आवश्यक है?
ta: சேவை தேவையா?
te: సర్వీస్ అవసరమా?

source: Service Type:
hi: सेवा का प्रकार:
ta: சேவை வகை:
te: సర్వీస్ రకం:

# countersCount
source: No. of Counters
hi: काउंटरों की संख्या
ta: கவுண்டர்களின் எண்ணிக்கை
te: కౌంటర్ల సంఖ్య

# ratePerStaff
source: Rate/Staff (₹)
hi: दर/स्टाफ (₹)
ta: விலை/ஊழியர் (₹)
te: ధర/స్టాఫ్ (₹)

source: Staff Required
hi: आवश्यक स्टाफ
ta: தேவையான ஊழியர்கள்
te: అవసరమైన స్టాఫ్

# costWithRupee
source: Cost: ₹{cost}
hi: लागत: ₹{cost}
ta: செலவு: ₹{cost}
te: ధర: ₹{cost}

source: Counter Setup Needed?
hi: क्या काउंटर सेटअप की आवश्यकता है?
ta: கவுண்டர் அமைப்பு தேவையா?
te: కౌంటర్ సెటప్ అవసరమా?

# ratePerCounter
source: Rate/Counter (₹)
hi: दर/काउंटर (₹)
ta: விலை/கவுண்டர் (₹)
te: ధర/కౌంటర్ (₹)

# counterCostWithRupee
source: Counter Cost: ₹{cost}
hi: काउंटर लागत: ₹{cost}
ta: கவுண்டர் செலவு: ₹{cost}
te: కౌంటర్ ధర: ₹{cost}

# discountWithPercent
source: Discount ({percent}%):
hi: छूट ({percent}%):
ta: தள்ளுபடி ({percent}%):
te: డిస్కౌంట్ ({percent}%):

source: Service Cost:
hi: सेवा लागत:
ta: சேவை செலவு:
te: సర్వీస్ ధర:

source: Counter Setup:
hi: काउंटर सेटअप:
ta: கவுண்டர் அமைப்பு:
te: కౌంటర్ సెటప్:

source: GRAND TOTAL:
hi: कुल योग:
ta: மொத்த தொகை:
te: మొత్తం:

source: Notes
hi: नोट्स
ta: குறிப்புகள்
te: గమనికలు

source: SAVE ORDER
hi: ऑर्डर सहेजें
ta: ஆர்டரைச் சேமி
te: ఆర్డర్ సేవ్ చేయి

source: ✅ Order saved
hi: ✅ ऑर्डर सहेजा गया
ta: ✅ ஆர்டர் சேமிக்கப்பட்டது
te: ✅ ఆర్డర్ సేవ్ చేయబడింది

# saveOrderError
source: Error saving order: {error}
hi: ऑर्डर सहेजने में त्रुटि: {error}
ta: ஆர்டரைச் சேமிப்பதில் பிழை: {error}
te: ఆర్డర్ సేవ్ చేయడంలో లోపం: {error}

source: Type dish name
hi: डिश का नाम लिखें
ta: உணவு பெயரை தட்டச்சு செய்க
te: డిష్ పేరు టైప్ చేయండి

source: Rate
hi: दर
ta: விலை
te: ధర

source: Qty
hi: मात्र
ta: எண்ணிக்கை
te: సంఖ్య

source: Cost
hi: लागत
ta: செலவு
te: మొత్తం

source: Required
hi: आवश्यक
ta: தேவை
te: అవసరం

source: Reset Calculation
hi: गणना रीसेट करें
ta: கணக்கீட்டை மீட்டமை
te: లెక్కింపు రీసెట్ చేయి

source: Breakfast
hi: नाश्ता
ta: காலை உணவு
te: అల్పాహారం

source: Lunch
hi: दोपहर का भोजन
ta: மதிய உணவு
te: మధ్యాహ్న భోజనం

source: Dinner
hi: रात का खाना
ta: இரவு உணவு
te: రాత్రి భోజనం

source: Snacks/Others
hi: नाश्ता/अन्य
ta: சிற்றுண்டி/மற்றவை
te: స్నాక్స్/ఇతర

source: Veg
hi: शाकाहारी
ta: சைவம்
te: శాకాహారం

source: Non-Veg
hi: मांषाजी
ta: அசைவம்
te: మాంసాహారం

# failedLoadOrders
source: Failed to load orders: {error}
hi: ऑर्डर लोड करने में विफल: {error}
ta: ஆர்டர்களை ஏற்றுவதில் தோல்வி: {error}
te: ఆర్డర్లు లోడ్ చేయడంలో విఫలమైంది: {error}

# errorLoadingOrders
source: Error loading orders: {error}
hi: त्रुटि: {error}
ta: பிழை: {error}
te: లోపం: {error}

source: Cannot edit past orders.
hi: पिछले ऑर्डर संपादित नहीं कर सकते।
ta: கடந்த ஆர்டர்களைத் திருத்த முடியாது.
te: గత ఆర్డర్లను సవరించలేరు.

source: Cannot delete past orders.
hi: पिछले ऑर्डर हटा नहीं सकते।
ta: கடந்த ஆர்டர்களை நீக்க முடியாது.
te: గత ఆర్డర్లను తొలగించలేరు.

# deleteOrderTitle
source: Delete Order?
hi: ऑर्डर हटाएं?
ta: ஆர்டரை நீக்கவா?
te: ఆర్డర్ తొలగించాలా?

# deleteOrderConfirm
source: This will remove the order locally. (Will sync when online)
hi: यह स्थानीय रूप से हटा देगा। (ऑनलाइन होने पर सिंक होगा)
ta: இது உள்ளூர் பதிப்பை நீக்கும். (ஆன்லைனில் ஒத்திசைக்கப்படும்)
te: ఇది స్థానిక కాపీని తొలగిస్తుంది. (ఆన్‌లైన్‌లో ఉన్నప్పుడు సింక్ అవుతుంది)

source: Cancel
hi: रद्द करें
ta: ரத்துசெய்
te: రద్దు చేయి

source: Delete
hi: हटाएं
ta: நீக்கு
te: తొలగించు

source: Confirm
hi: पुष्टि करें
ta: உறுதிசெய்
te: నిర్ధారించు

# requiredField
source: Required
hi: आवश्यक
ta: தேவை
te: అవసరం

# error
source: Error: {error}
hi: त्रुटि: {error}
ta: பிழை: {error}
te: లోపం: {error}

# orderDeleted
source: Order deleted (will sync when online)
hi: ऑर्डर हटा दिया गया
ta: ஆர்டர் நீக்கப்பட்டது
te: ఆర్డర్ తొలగించబడింది

# errorDeletingOrder
source: Error deleting order: {error}
hi: हटाने में त्रुटि: {error}
ta: நீக்குவதில் பிழை: {error}
te: తొలగించడంలో లోపం: {error}

# ordersCount
source: {count} orders
hi: {count} ऑर्डर
ta: {count} ஆர்டர்கள்
te: {count} ఆర్డర్లు

source: No location
hi: कोई स्थान नहीं
ta: இடம் இல்லை
te: స్థానం లేదు

source: Unnamed
hi: बेनाम
ta: பெயரிடப்படாத
te: పేరులేని

# ordersDateTitle
source: Orders - {date}
hi: ऑर्डर - {date}
ta: ஆர்டர்கள் - {date}
te: ఆర్డర్లు - {date}

source: Dish Summary
hi: डिश सारांश
ta: உணவுச் சுருக்கம்
te: డిష్ సారాంశం

source: Retry
hi: पुनः प्रयास करें
ta: மீண்டும் முயற்சி
te: మళ్ళీ ప్రయత్నించు

# noOrdersFound
source: No orders found for this date
hi: इस तारीख के लिए कोई ऑर्डर नहीं
ta: இந்தத் தேதியில் ஆர்டர்கள் இல்லை
te: ఈ తేదీన ఆర్డర్లు లేవు

source: Veg: {count}
hi: शाकाहारी: {count}
ta: சைவம்: {count}
te: శాకాహారం: {count}

source: Non-Veg: {count}
hi: मांसाहारी: {count}
ta: அசைவம்: {count}
te: మాంసాహారం: {count}

source: Total: {count}
hi: कुल: {count}
ta: மொத்தம்: {count}
te: మొత్తం: {count}

# failedLoadSummary
source: Failed to load summary: {error}
hi: सारांश लोड करने में विफल: {error}
ta: சுருக்கத்தை ஏற்றுவதில் தோல்வி: {error}
te: సారాంశం లోడ్ చేయడంలో విఫలమైంది: {error}

# errorLoadingSummary
source: Error loading summary: {error}
hi: त्रुटि: {error}
ta: பிழை: {error}
te: లోపం: {error}

# summaryDateTitle
source: Summary - {date}
hi: सारांश - {date}
ta: சுருக்கம் - {date}
te: సారాంశం - {date}

# noDishesFound
source: No dishes found for this date
hi: कोई व्यंजन नहीं मिला
ta: உணவுகள் எதுவும் இல்லை
te: డిష్‌లు లేవు

source: Unnamed dish
hi: बेनाम व्यंजन
ta: பெயரிடப்படாத உணவு
te: పేరులేని డిష్

# qtyWithCount
source: Qty: {count}
hi: मात्रा: {count}
ta: எண்ணிக்கை: {count}
te: సంఖ్య: {count}

# qtyLabel
source: Qty
hi: मात्रा
ta: எண்ணிக்கை
te: సంఖ్య

# reportsTitle
source: Reports
hi: रिपोर्ट
ta: அறிக்கைகள்
te: నివేదికలు

# periodLabel
source: Period:
hi: अवधि:
ta: காலம்:
te: కాలం:

source: Day
hi: दिन
ta: நாள்
te: రోజు

source: Week
hi: सप्ताह
ta: வாரம்
te: వారం

source: Month
hi: महीना
ta: மாதம்
te: నెల

source: Year
hi: वर्ष
ta: வருடம்
te: సంవత్సరం

source: Payroll
hi: पेरोल
ta: சம்பளம்
te: జీతం

source: Orders
hi: ऑर्डर
ta: ஆர்டர்கள்
te: ఆర్డర్లు

source: Kitchen
hi: रसोई
ta: சமையலறை
te: కిచెన్

source: Dispatch
hi: डिस्पैच
ta: அனுப்புதல்
te: డిస్పాచ్

source: HR
hi: मानव संसाधन
ta: ஊழியர் வளம்

# noDataSelectedPeriod
source: No data for selected period
hi: चयनित अवधि के लिए कोई डेटा नहीं
ta: தேர்ந்தெடுத்த காலத்தில் தரவு இல்லை
te: ఎంచుకున్న కాలంలో డేటా లేదు

source: Revenue
hi: राजस्व
ta: வருவாய்
te: ఆదాయం

source: Confirmed
hi: पुष्टि की गई
ta: உறுதி செய்யப்பட்டது
te: ధృవీకరించబడింది

source: Completed
hi: पूरा हुआ
ta: முடிந்தது
te: పూర్తయింది

source: Cancelled
hi: रद्द किया गया
ta: ரத்து செய்யப்பட்டது
te: రద్దు చేయబడింది

source: Total Orders
hi: कुल ऑर्डर
ta: மொத்த ஆர்டர்கள்
te: మొత్తం ఆర్డర్లు

source: In Progress
hi: प्रगति में
ta: செயல்பாட்டில்
te: పురోగతిలో ఉంది

source: Pending
hi: लंबित
ta: நிலுவையில்
te: పెండింగ్‌లో ఉంది

source: Delivered
hi: वितरित
ta: வழங்கப்பட்டது
te: డెలివరీ చేయబడింది

source: In Transit
hi: रास्ते में
ta: வழியில்
te: దారిలో ఉంది

# totalDispatches
source: Dispatches
hi: कुल डिस्पैच
ta: மொத்த அனுப்புதல்கள்
te: మొత్తం డిస్పాచ్‌లు

source: Staff
hi: स्टाफ
ta: ஊழியர்கள்
te: స్టాఫ్

source: Attendance
hi: उपस्थिति
ta: வருகை
te: హాజరు

source: Hours
hi: घंटे
ta: மணிநேரம்
te: గంటలు

# overtime
source: OT
hi: ओवरटाइम
ta: கூடுதல் நேரம்
te: ఓవర్‌టైమ్

source: OT Pay
hi: ओवरटाइम वेतन
ta: கூடுதல் நேர ஊதியம்
te: OT చెల్లింపు

source: Staff with OT
hi: ओवरटाइम वाले स्टाफ
ta: கூடுதல் நேரம் செய்தவர்கள்
te: OT చేసిన స్టాఫ్

source: Total OT
hi: कुल ओवरटाइम
ta: மொத்த கூடுதல் நேரம்
te: మొత్తం OT

# noOvertime
source: No overtime recorded
hi: कोई ओवरटाइम नहीं
ta: கூடுதல் நேரம் இல்லை
te: OT లేదు

# financeTitle
source: Finance
hi: वित्त
ta: நிதி
te: ఆర్థిక

source: Income
hi: आय
ta: வருமானம்
te: ఆదాయం

source: Expense
hi: व्यय
ta: செலவு
te: ఖర్చు

source: Net Balance
hi: शुद्ध शेष
ta: நிகர இருப்பு
te: నికర నిల్వ

source: Transactions
hi: लेन-देन
ta: பரிவர்த்தனைகள்
te: లావాదేవీలు

source: Ledgers
hi: खाता बही
ta: கணக்கேடுகள்
te: లెడ్జర్లు

source: Export
hi: निर्यात
ta: ஏற்றுமதி
te: ఎగుమతి

source: Recent Transactions
hi: हाल के लेन-देन
ta: சமீபத்திய பரிவர்த்தனைகள்
te: ఇటీవలి లావాదేవీలు

source: No transactions found
hi: कोई लेन-देन नहीं मिला
ta: பரிவர்த்தனைகள் இல்லை
te: లావాదేవీలు లేవు

# exportingReport
source: Exporting Finance Report... (Mock)
hi: रिपोर्ट निर्यात की जा रही है...
ta: ஏற்றுமதி செய்கிறது...
te: రిపోర్ట్ ఎగుమతి అవుతోంది...

# filterAll
source: All
hi: सभी
ta: எல்லாம்
te: అన్నీ

# deleteTransactionTitle
source: Delete Transaction?
hi: हटाएं?
ta: நீக்கவா?
te: తొలగించాలా?

# deleteTransactionContent
source: This cannot be undone.
hi: इसे पूर्ववत नहीं किया जा सकता।
ta: இதை மாற்ற முடியாது.
te: దీన్ని వెనక్కి తీసుకోలేము.

source: Suppliers
hi: आपूर्तिकर्ता
ta: விநியோகஸ்தர்கள்
te: సరఫరాదారులు

source: Customers
hi: ग्राहक
ta: வாடிக்கையாளர்கள்
te: కస్టమర్లు

source: Coming Soon
hi: जल्द आ रहा है
ta: விரைவில்
te: త్వరలో వస్తుంది

source: Add Income
hi: आय जोड़ें
ta: வருமானம் சேர்
te: ఆదాయం జోడించు

source: Add Expense
hi: व्यय जोड़ें
ta: செலவு சேர்
te: ఖర్చు జోడించు

# amountLabel
source: Amount
hi: राशि
ta: தொகை
te: మొత్తం

# categoryLabel
source: Category
hi: श्रेणी
ta: வகை
te: వర్గం

# paymentModeLabel
source: Payment Mode
hi: भुगतान मोड
ta: கட்டண முறை
te: చెల్లింపు పద్ధతి

# descriptionLabel
source: Description / Notes
hi: विवरण / नोट्स
ta: விளக்கம் / குறிப்புகள்
te: వివరణ / గమనికలు

source: Save Transaction
hi: सहेजें
ta: சேமி
te: సేవ్ చేయి

source: Enter amount
hi: राशि दर्ज करें
ta: தொகையை உள்ளிடு
te: మొత్తం నమోదు చేయి

source: Invalid amount
hi: अमान्य राशि
ta: தவறான தொகை
te: తప్పు మొత్తం

source: Transaction Saved
hi: लेन-देन सहेजा गया
ta: பரிவர்த்தனை சேமிக்கப்பட்டது
te: లావాదేవీ సేవ్ చేయబడింది

source: Collect Payment
hi: भुगतान प्राप्त करें
ta: கட்டணம் பெறு
te: చెల్లింపు తీసుకోండి

source: Select Payment Method
hi: विधि चुनें
ta: முறையைத் தேர்ந்தெடு
te: పద్ధతి ఎంచుకోండి

source: UPI (Razorpay)
hi: यूपीआई (Razorpay)

# cardRazorpay
source: Credit/Debit Card (Razorpay)
hi: कार्ड (Razorpay)
ta: Card (Razorpay)
te: Card (Razorpay)

source: Payment Successful!
hi: भुगतान सफल!
ta: கட்டணம் வெற்றி!
te: చెల్లింపు విజయవంతం!

# paymentReceivedMsg
source: Payment of {amount} received for Order #{orderId}
hi: ₹{amount} प्राप्त हुए (ऑर्डर #{orderId})
ta: ₹{amount} பெறப்பட்டது (ஆர்டர் #{orderId})
te: ₹{amount} స్వీకరించబడింది (ఆర్డర్ #{orderId})

# paymentFailed
source: Payment Failed: {error}
hi: विफल: {error}
ta: தோல்வி: {error}
te: విఫలమైంది: {error}

# chooseSubscription
source: Choose Subscription Plan
hi: सदस्यता योजना चुनें
ta: சந்தா திட்டத்தைத் தேர்ந்தெடு
te: సభ్యత్వ ప్లాన్ ఎంచుకోండి

# selectStartPlan
source: Select Your Plan
hi: योजना चुनें
ta: திட்டத்தைத் தேர்ந்தெடு
te: ప్లాన్ ఎంచుకోండి

# payBtn
source: Pay {amount}
hi: भुगतान करें ₹{amount}
ta: செலுத்து ₹{amount}
te: చెల్లించండి ₹{amount}

source: Subscription Activated!
hi: सदस्यता सक्रिय!
ta: சந்தா செயல்படுத்தப்பட்டது!
te: సభ్యత్వం ప్రారంభించబడింది!

# planActiveUntil
source: Your plan is now active until {date}.
hi: {date} तक सक्रिय।
ta: {date} வரை செயலில் இருக்கும்.
te: {date} వరకు యాక్టివ్‌గా ఉంటుంది.

# continueBtn
source: Continue
hi: जारी रखें
ta: தொடர்
te: కొనసాగించు

# auditReportTitle
source: Audit Report
hi: ऑडिट रिपोर्ट
ta: தணிக்கை அறிக்கை
te: ఆడిట్ నివేదిక

# noLogsExport
source: No logs to export
hi: निर्यात के लिए कोई लॉग नहीं
ta: ஏற்றுமதி செய்ய பதிவுகள் இல்லை
te: ఎగుమతి చేయడానికి లాగ్‌లు లేవు

# exportFailed
source: Export failed: {error}
hi: विफल: {error}
ta: தோல்வி: {error}
te: విఫలమైంది: {error}

source: Start Date
hi: प्रारंभ तिथि
ta: தொடக்க தேதி
te: ప్రారంభ తేదీ

source: End Date
hi: अंतिम तिथि
ta: முடிவு தேதி
te: ముగింపు తేదీ

# userIdLabel
source: User ID
hi: उपयोगकर्ता आईडी
ta: பயனர் ஐடி
te: యూజర్ ID

# tableLabel
source: Table
hi: तालिका
ta: அட்டவணை
te: పట్టిక

# noAuditLogs
source: No audit logs found
hi: कोई लॉग नहीं
ta: பதிவுகள் இல்லை
te: లాగ్‌లు లేవు

source: Changed: {fields}
hi: परिवर्तन: {fields}
ta: மாற்றம்: {fields}
te: మార్పులు: {fields}

source: Before: {val}
hi: पहले: {val}
ta: முன்: {val}
te: ముందు: {val}

source: After: {val}
hi: बाद में: {val}
ta: பின்: {val}
te: తర్వాత: {val}

source: Kitchen View
hi: रसोई
ta: சமையலறை
te: కిచెన్

source: Dispatch View
hi: डिस्पैच
ta: அனுப்புதல்
te: డిస్పాచ్
