Repository: ruchiservapp-dot/Ruchiserv
Catalog: lib/l10n/app_*.arb
Languages: hi, ta, te

source: Punch In/Out
hi: पंच इन/आउट
ta: பஞ்ச் இன்/அவுட்
te: పంచ్ ఇన్/అవుట్

source: Staff Management
hi: स्टाफ प्रबंधन
ta: ஊழியர் மேலாண்மை
te: స్టాఫ్ నిర్వహణ

source: Admin Only
hi: केवल एडमिन
ta: நிர்வாகி மட்டும்
te: అడ్మిన్ మాత్రమే

# restrictedToAdmins
source: ⛔ Staff Management is restricted to Admins
hi: ⛔ केवल एडमिन के लिए
ta: ⛔ நிர்வாகிகளுக்கு மட்டும்
te: ⛔ అడ్మిన్లకు మాత్రమే

source: Utensils
hi: बर्तन
ta: பாத்திரங்கள்
te: పాత్రలు

source: Kitchen Operations
hi: रसोई संचालन
ta: சமையலறை செயல்பாடுகள்
te: కిచెన్ కార్యకలాపాలు

source: Orders View
hi: ऑर्डर
ta: ஆர்டர்கள்
te: ఆర్డర్లు

source: Production Queue
hi: उत्पादन कतार
ta: உற்பத்தி வரிசை
te: ఉత్పత్తి క్యూ

source: Ready
hi: तैयार
ta: தயார்
te: సిద్ధం

source: Other
hi: अन्य
ta: மற்றவை
te: ఇతర

source: Internal Kitchen
hi: आंतरिक रसोई
ta: உள் சமையலறை
te: అంతర్గత కిచెన్

source: Subcontract
hi: सबकांट्रैक्ट
ta: துணை ஒப்பந்தம்
te: సబ్‌కాంట్రాక్ట్

source: Live Counter
hi: लाइव काउंटर
ta: லைவ் கவுண்டர்
te: లైవ్ కౌంటర్

source: 🔥 PREP INGREDIENTS
hi: 🔥 सामग्री तैयार करें
ta: 🔥 பொருட்களை தயார் செய்
te: 🔥 పదార్థాలు సిద్ధం చేయండి

source: LIVE
hi: लाइव
ta: லைவ்
te: లైవ్

source: Prep
hi: तैयारी
ta: தயாரிப்பு
te: తయారీ

source: Start
hi: शुरू
ta: தொடங்கு
te: ప్రారంభించు

source: Prepping
hi: तैयारी चल रही है
ta: தயாராகிறது
te: తయారవుతోంది

source: In Queue
hi: कतार में
ta: வரிசையில்
te: క్యూలో ఉంది

source: Assign / Edit
hi: सौंपें / संपादित करें
ta: ஒதுக்கு / திருத்து
te: కేటాయించు / సవరించు

source: Production Settings
hi: उत्पादन सेटिंग्स
ta: உற்பத்தி அமைப்புகள்
te: ఉత్పత్తి సెట్టింగ్‌లు

# noItemsInQueue
source: No items in production queue
hi: कतार में कोई आइटम नहीं
ta: வரிசையில் உருப்படிகள் இல்லை
te: క్యూలో అంశాలు లేవు

source: Done
hi: हो गया
ta: முடிந்தது
te: పూర్తయింది

# noRecipeDefined
source: No recipe defined for this dish
hi: कोई रेसिपी नहीं
ta: செய்முறை இல்லை
te: రెసిపీ లేదు

source: 📋 Ingredients Required:
hi: 📋 आवश्यक सामग्री:
ta: 📋 தேவையான பொருட்கள்:
te: 📋 కావలసిన పదార్థాలు:

source: No ready items
hi: कोई तैयार आइटम नहीं
ta: தயாரான உருப்படிகள் இல்லை
te: సిద్ధమైన అంశాలు లేవు

# returnItem
source: Return
hi: वापस करें
ta: திருப்பி அனுப்பு
te: వాపసు

# paxLabel
source: Pax: {count}
hi: पैक्स: {count}
ta: நபர்கள்: {count}
te: వ్యక్తులు: {count}

# locLabel
source: Loc: {location}
hi: स्थान: {location}
ta: இடம்: {location}
te: స్థానం: {location}

source: N/A
hi: लागू नहीं
te: వర్తించదు

# noOrdersForDispatch
source: No orders available for dispatch today
hi: डिस्पैच के लिए कोई ऑर्डर नहीं
ta: அனுப்ப ஆர்டர்கள் இல்லை
te: డిస్పాచ్ కోసం ఆర్డర్లు లేవు

source: Create Dispatch
hi: डिस्पैच बनाएं
ta: அனுப்புதலை உருவாக்கு
te: డిస్పాచ్ సృష్టించు

source: Dispatch Details
hi: विवरण
ta: விவரங்கள்
te: వివరాలు

source: Driver Name
hi: ड्राइवर का नाम
ta: ஓட்டுநர் பெயர்
te: డ్రైవర్ పేరు

source: Vehicle Number
hi: वाहन नंबर
ta: வாகன எண்
te: వాహనం నంబర్

# noPendingDispatches
source: No pending dispatches yet!
hi: कोई लंबित डिस्पैच नहीं!
ta: நிலுவையில் இல்லை!
te: పెండింగ్ లేదు!

# tapToAddDispatch
source: Tap the '+' button to create a new dispatch.
hi: + टैप करके जोड़ें।
ta: + தட்டி சேர்க்கவும்.
te: + నొక్కి జోడించండి.

# orderFor
source: Order for: {name}
hi: ऑर्डर: {name}
ta: ஆர்டர்: {name}
te: ఆర్డర్: {name}

# driverWithVehicle
source: Driver: {driver} ({vehicle})
hi: ड्राइवर: {driver} ({vehicle})
ta: ஓட்டுநர்: {driver} ({vehicle})
te: డ్రైవర్: {driver} ({vehicle})

# statusPending
source: Pending
hi: लंबित
ta: நிலுவையில்
te: పెండింగ్

# statusDispatched
source: DISPATCHED
hi: भेजा गया
ta: அனுப்பப்பட்டது
te: పంపబడింది

# statusDelivered
source: DELIVERED
hi: वितरित
ta: வழங்கப்பட்டது
te: డెలివరీ చేయబడింది

# failedUpdateStatus
source: Failed to update status: {error}
hi: विफल: {error}
ta: தோல்வி: {error}
te: విఫలమైంది: {error}

source: Daily Wage
hi: दैनिक वेतन
ta: தினக்கூலி
te: రోజువారీ కూలీ

source: No staff members
hi: कोई स्टाफ नहीं
ta: ஊழியர்கள் இல்லை
te: స్టాఫ్ లేరు

source: Tap + to add staff
hi: + टैप करके स्टाफ जोड़ें
ta: + தட்டி ஊழியரைச் சேர்
te: + నొక్కి స్టాఫ్ జోడించు

source: Unknown
hi: अज्ञात
ta: தெரியாத
te: తెలియదు

source: No mobile
hi: मोबाइल नहीं
ta: மொபைல் இல்லை
te: మొబైల్ లేదు

source: Permanent
hi: स्थायी
ta: நிரந்தரம்
te: శాశ్వత

source: Contractor
hi: ठेकेदार
ta: ஒப்பந்தம்
te: కాంట్రాక్ట్

# alreadyPunchedIn
source: Already punched in today!
hi: आज पहले ही पंच इन कर चुके हैं!
ta: ஏற்கனவே பஞ்ச் இன் செய்துள்ளீர்கள்!
te: ఈ రోజు ఇప్పటికే పంచ్ ఇన్ చేశారు!

source: Could not get location
hi: स्थान प्राप्त नहीं कर सके
ta: இடத்தைக் கண்டறிய முடியவில்லை
te: స్థానం పొందలేకపోయాము

# punchedInGeo
source: ✓ Punched In (Within Geo-fence)
hi: ✓ पंच इन (सीमा के भीतर)
ta: ✓ பஞ்ச் இன் (எல்லைக்குள்)
te: ✓ పంచ్ ఇన్ (పరిధిలో)

# punchedInNoGeo
source: ⚠️ Punched In (Outside Geo-fence)
hi: ⚠️ पंच इन (सीमा के बाहर)
ta: ⚠️ பஞ்ச் இன் (எல்லைக்கு வெளியே)
te: ⚠️ పంచ్ ఇన్ (పరిధి బయట)

# punchedOutMsg
source: Punched Out - {hours} hrs{ot}
hi: पंच आउट - {hours} घंटे {ot}
ta: பஞ்ச் அவுட் - {hours} மணி {ot}
te: పంచ్ అవుట్ - {hours} గంటలు {ot}

source: Total Staff
hi: कुल स्टाफ
ta: மொத்த ஊழியர்கள்
te: మొత్తం స్టాఫ్

source: Present
hi: उपस्थित
ta: வருகை
te: హాజరు

source: Absent
hi: अनुपस्थित
ta: வரவில்லை
te: గైర్హాజరు

# noAttendanceToday
source: No attendance records today
hi: आज कोई उपस्थिति नहीं
ta: இன்று பதிவு இல்லை
te: ఈ రోజు హాజరు లేదు

# workingStatus
source: working
hi: काम कर रहे हैं
ta: வேலை செய்கிறார்
te: పని చేస్తున్నారు

source: Add Staff
hi: स्टाफ जोड़ें
ta: ஊழியரைச் சேர்
te: స్టాఫ్ జోడించు

source: Staff Details
hi: स्टाफ विवरण
ta: ஊழியர் விவரங்கள்
te: స్టాఫ్ వివరాలు

# tapToPhoto
source: Tap to {action} photo
hi: फोटो {action} के लिए टैप करें
ta: புகைப்படம் {action} தட்டவும்
te: ఫోటో {action} నొక్కండి

# basicInfo
source: Basic Information
hi: बुनियादी जानकारी
ta: அடிப்படைத் தகவல்
te: ప్రాథమిక సమాచారం

source: Full Name *
hi: पूरा नाम *
ta: முழுப் பெயர் *
te: పూర్తి పేరు *

source: Role/Designation
hi: पद
ta: பதவி
te: హోదా

source: Staff Type
hi: प्रकार
ta: வகை
te: రకం

source: Email
hi: ईमेल
ta: மின்னஞ்சல்
te: ఇమెయిల్

source: Salary & Rates
hi: वेतन दरें
ta: சம்பள விகிதங்கள்
te: జీతం వివరాలు

source: Monthly Salary (₹)
hi: मासिक वेतन (₹)
ta: மாதச் சம்பளம் (₹)
te: నెల జీతం (₹)

source: Payout Frequency
hi: भुगतान आवृत्ति
ta: வழங்கும் முறை
te: చెల్లింపు విధానం

# dailyWageLabel
source: Daily Wage (₹)
hi: दैनिक वेतन (₹)
ta: தினக்கூலி (₹)
te: రోజువారీ కూలీ (₹)

source: Hourly Rate (₹)
hi: प्रति घंटा दर (₹)
ta: மணிநேர விகிதம் (₹)
te: గంటకు (₹)

source: Bank & ID Details
hi: बैंक और आईडी विवरण
ta: வங்கி & அடையாள விவரங்கள்
te: బ్యాంక్ & ID వివరాలు

source: Bank Name
hi: बैंक का नाम
ta: வங்கி பெயர்
te: బ్యాంక్ పేరు

source: Account Number
hi: खाता संख्या
ta: கணக்கு எண்
te: ఖాతా నంబర్

source: IFSC Code
hi: आईएफएससी कोड
ta: IFSC குறியீடு
te: IFSC కోడ్

source: Aadhar Number
hi: आधार नंबर
ta: ஆதார் எண்
te: ఆధార్ నంబర్

source: Emergency Contact
hi: आपातकालीन संपर्क
ta: அவசரத் தொடர்பு
te: అత్యవసర పరిచయం

source: Contact Name
hi: नाम
ta: பெயர்
te: పేరు

source: Contact Number
hi: नंबर
ta: எண்
te: నంబర్

source: Address
hi: पता
ta: முகவரி
te: చిరునామా

# addStaffBtn
source: ADD STAFF
hi: जोड़ें
ta: சேர்
te: జోడించు

source: SAVE CHANGES
hi: परिवर्तन सहेजें
ta: மாற்றங்களைச் சேமி
te: మార్పులు సేవ్ చేయి

source: Advances
hi: अग्रिम
ta: முன்பணம்
te: అడ్వాన్స్

source: Total Advances
hi: कुल अग्रिम
ta: மொத்த முன்பணம்
te: మొత్తం అడ్వాన్స్

source: Pending Deduction
hi: लंबित कटौती
ta: நிலுவை பிடித்தம்
te: పెండింగ్ మినహాయింపు

source: Add Advance
hi: अग्रिम जोड़ें
ta: முன்பணம் சேர்
te: అడ్వాన్స్ జోడించు

# noAdvances
source: No advances recorded
hi: कोई अग्रिम नहीं
ta: முன்பணம் இல்லை
te: అడ్వాన్స్ లేదు

source: Deducted
hi: कटौती की गई
ta: பிடிக்கப்பட்டது
te: మినహాయించబడింది

source: Delete Staff
hi: स्टाफ हटाएं
ta: ஊழியரை நீக்கு
te: స్టాఫ్ తొలగించు

# deleteStaffConfirm
source: Are you sure you want to delete this staff member? This cannot be undone.
hi: निश्चित रूप से हटाएं? इसे पूर्ववत नहीं किया जा सकता।
ta: நிச்சயமாக நீக்கவா? இதை மாற்ற முடியாது.
te: ఖచ్చితంగా తొలగించాలా? దీన్ని వెనక్కి తీసుకోలేము.

source: Staff deleted
hi: हटा दिया गया
ta: நீக்கப்பட்டது
te: తొలగించబడింది

source: Staff added!
hi: जोड़ा गया!
ta: சேர்க்கப்பட்டது!
te: జోడించబడింది!

source: Staff updated!
hi: अपडेट किया गया!
ta: புதுப்பிக்கப்பட்டது!
te: నవీకరించబడింది!

source: Select Photo
hi: फोटो चुनें
ta: புகைப்படம் தேர்ந்தெடு
te: ఫోటో ఎంచుకోండి

source: Camera
hi: कैमरा
ta: கேமரா
te: కెమెరా

source: Gallery
hi: गेलरी
ta: கேலரி
te: గ్యాలరీ

# photoSelectedWeb
source: Photo selected (Web Mode)
hi: फोटो चुना गया
ta: புகைப்படம் தேர்ந்தெடுக்கப்பட்டது
te: ఫోటో ఎంచుకోబడింది

source: Photo updated
hi: अपडेट किया गया
ta: புதுப்பிக்கப்பட்டது
te: నవీకరించబడింది

# amountRupee
source: Amount (₹)
hi: राशि (₹)
ta: தொகை (₹)
te: మొత్తం (₹)

source: Staff Payroll
hi: स्टाफ पेरोल
ta: சம்பள பட்டியல்
te: స్టాఫ్ పేరోల్

source: Base Pay
hi: मूल वेतन
ta: அடிப்படை ஊதியம்
te: మూల వేతనం

source: Net Pay
hi: शुद्ध वेतन
ta: நிகர ஊதியம்
te: నికర వేతనం

source: No staff data
hi: कोई डेटा नहीं
ta: தரவு இல்லை
te: డేటా లేదు

source: Process Payroll
hi: वेतन संसाधित करें
ta: சம்பளம் கணக்கிடு
te: జీతం లెక్కించు

# processPayrollConfirm
source: Mark all pending advances as deducted for {name} for {date}?
hi: क्या {name} के लिए अग्रिम में कटौती करें ({date})?
ta: {name}-க்கு முன்பணத்தைக் கழித்து விடவா ({date})?
te: {name} యొక్క అడ్వాన్స్ మినహాయించి జీతం వేయాలా ({date})?

# payrollProcessed
source: Payroll processed for {name}
hi: {name} का वेतन संसाधित किया गया
ta: {name}-க்கு சம்பளம் கணக்கிடப்பட்டது
te: {name} కు జీతం లెక్కించబడింది

source: Advance Deduction
hi: अग्रिम कटौती
ta: முன்பணக் கழிவு
te: అడ్వాన్స్ మినహాయింపు

source: Net Payable
hi: देय राशि
ta: செலுத்த வேண்டியது
te: చెల్లించవలసినది

source: Mark Advances Deducted
hi: कटौती के रूप में चिह्नित करें
ta: கழித்ததாகக் குறிக்கவும்
te: మినహాయించినట్లు మార్క్ చేయి

# otMultiplierInfo
source: OT Multiplier: {rate}x | OT = hours > 8 × hourly rate × {rate}
hi: OT गुणक: {rate}x | 8 घंटे से अधिक
ta: OT பெருக்கி: {rate}x | 8 மணிக்கு மேல்
te: OT గుణకం: {rate}x | 8 గంటల పైన

source: Utensils Tracking
hi: बर्तन ट्रैकिंग
ta: பாத்திரக் கண்காணிப்பு
te: పాత్రల ట్రాకింగ్

# noUtensilsAdded
source: No utensils added yet
hi: कोई बर्तन नहीं
ta: பாத்திரங்கள் இல்லை
te: పాత్రలు లేవు

source: Add First Utensil
hi: पहला बर्तन जोड़ें
ta: முதல் பாத்திரத்தைச் சேர்
te: మొదటి పాత్రను జోడించు

source: Add Utensil
hi: बर्तन जोड़ें
ta: பாத்திரம் சேர்
te: పాత్ర జోడించు

source: Utensil Name
hi: बर्तन का नाम
ta: பாத்திரப் பெயர்
te: పాత్ర పేరు

# utensilNameHint
source: e.g., Plates, Spoons, Cups
hi: उदा. प्लेट, कप
ta: எ.கா. தட்டு, குவளை
te: ఉదా. ప్లేటు, కప్పు

source: Total Stock
hi: कुल स्टॉक
ta: மொத்த இருப்பு
te: మొత్తం స్టాక్

source: Available Stock
hi: उपलब्ध स्टॉक
ta: கையிருப்பு
te: అందుబాటులో ఉన్న స్టాక్

source: Enter quantity
hi: मात्रा दर्ज करें
ta: எண்ணிக்கை
te: సంఖ్య నమోదు చేయి

# enterUtensilName
source: Please enter utensil name
hi: नाम दर्ज करें
ta: பெயர்
te: పేరు నమోదు చేయి

source: ✅ Utensil added
hi: ✅ जोड़ा गया
ta: ✅ சேர்க்கப்பட்டது
te: ✅ జోడించబడింది

source: ✅ Utensil updated
hi: ✅ अपडेट किया गया
ta: ✅ புதுப்பிக்கப்பட்டது
te: ✅ నవీకరించబడింది

source: Utensil deleted
hi: हटा दिया गया
ta: நீக்கப்பட்டது
te: తొలగించబడింది

# editUtensil
source: Edit: {name}
hi: संपादित करें: {name}
ta: திருத்து: {name}
te: సవరించు: {name}

source: Delete Utensil?
hi: हटाएं?
ta: நீக்கவா?
te: తొలగించాలా?

# deleteUtensilConfirm
source: Are you sure you want to delete "{name}"?
hi: "{name}" को हटाएं?
ta: "{name}"-ஐ நீக்கவா?
te: "{name}" ను తొలగించాలా?

source: Save
hi: सहेजें
ta: சேமி
te: సేవ్ చేయి

source: Add
hi: जोड़ें
ta: சேர்
te: జోడించు

# availableCount
source: Available: {available} / {total}
hi: उपलब्ध: {available} / {total}
ta: கிடைப்பது: {available} / {total}
te: అందుబాటులో: {available} / {total}

# issuedCount
source: Issued: {issued} ({percent}% utilized)
hi: जारी: {issued} ({percent}%)
ta: வழங்கியது: {issued} ({percent}%)
te: ఇచ్చినవి: {issued} ({percent}%)

source: Inventory Hub
hi: इन्वेंट्री हब
ta: சரக்கு மையம்
te: ఇన్వెంటరీ హబ్

source: Ingredients
hi: सामग्री
ta: பொருட்கள்
te: పదార్థాలు

source: Master List
hi: मास्टर सूची
ta: முதன்மை பட்டியல்
te: మాస్టర్ లిస్ట్

source: BOM
hi: बीओएम

source: Recipe Mapping
hi: रेसिपी मैप
ta: செய்முறை
te: రెసిపీ మ్యాపింగ్

source: MRP Run
hi: एमआरपी रन
ta: MRP இயக்கம்
te: MRP రన్

source: Calculate
hi: गणना करें
ta: கணக்கிடு
te: లెక్కించు

source: Purchase Orders
hi: खरीद आदेश
ta: கொள்முதல் ஆர்டர்கள்
te: కొనుగోలు ఆర్డర్లు

# purchaseOrderShort
source: PO
hi: पीओ

source: Track Orders
hi: ऑर्डर ट्रैक करें
ta: ஆர்டர்கள்
te: ట్రాక్ ఆర్డర్లు

source: Vendors
hi: विक्रेता
ta: வியாபாரிகள்
te: విక్రేతలు

source: Subcontractors
hi: उपठेकेदार
ta: துணை ஒப்பந்தக்காரர்கள்
te: సబ్‌కాంట్రాక్టర్లు

source: Kitchens
hi: रसोई
ta: சமையலறைகள்
te: కిచెన్‌లు

source: Ingredients Master
hi: सामग्री मास्टर
ta: பொருட்கள் முதன்மை
te: పదార్థాల మాస్టర్

source: Ingredient Name
hi: सामग्री का नाम
ta: பொருள் பெயர்
te: పదార్థం పేరు

# skuBrandOptional
source: SKU / Brand Name (Optional)
hi: SKU / ब्रांड (वैकल्पिक)
ta: SKU / பிராண்ட் (விருப்பத் தேர்வு)
te: SKU / బ్రాండ్ (ఐచ్ఛికం)

source: Cost per Unit (₹)
hi: प्रति यूनिट लागत (₹)
ta: அலகு விலை (₹)
te: యూనిట్ ధర (₹)

source: Category
hi: श्रेणी
ta: வகை
te: వర్గం

source: Unit
hi: इकाई
ta: அலகு
te: యూనిట్

# unitKg
source: Kilogram (kg)
hi: किलोग्राम (kg)
ta: கிலோ (kg)
te: కిలో (kg)

# unitG
source: Gram (g)
hi: ग्राम (g)
ta: கிராம் (g)
te: గ్రాము (g)

# unitL
source: Liter
hi: लीटर
ta: லிட்டர்
te: లీటర్

# unitMl
source: Milliliter (ml)
hi: मिलीलीटर (ml)
ta: மில்லி லிட்டர் (ml)
te: మిల్లీ లీటర్ (ml)

# unitNos
source: Numbers (nos)
hi: संख्या (nos)
ta: எண்கள் (nos)
te: సంఖ్య (nos)

# unitBunch
source: Bunch
hi: गुच्छा
ta: கட்டு
te: కట్ట

# unitPcs
source: Pieces (pcs)
hi: टुकड़े (pcs)
ta: துண்டுகள் (pcs)
te: ముక్కలు (pcs)

source: Enter ingredient name
hi: नाम दर्ज करें
ta: பெயரை உள்ளிடு
te: పేరు నమోదు చేయి

source: ✅ Ingredient added
hi: ✅ जोड़ा गया
ta: ✅ சேர்க்கப்பட்டது
te: ✅ జోడించబడింది

source: Edit Ingredient
hi: संपादित करें
ta: திருத்து
te: సవరించు

source: ✅ Ingredient updated
hi: ✅ अपडेट किया गया
ta: ✅ புதுப்பிக்கப்பட்டது
te: ✅ నవీకరించబడింది

# searchPlaceholder
source: Search...
hi: खोजें...
ta: தேடு...
te: వెతకండి...

# ingredientsCount
source: {count} ingredients
hi: {count} सामग्री
ta: {count} பொருட்கள்
te: {count} పదార్థాలు

# categoriesCount
source: {count} categories
hi: {count} श्रेणियां
ta: {count} வகைகள்
te: {count} వర్గాలు

# catAll
source: All
hi: सभी
ta: எல்லாம்
te: అన్నీ

# catVegetable
source: Vegetable
hi: सब्जी
ta: காய்கறி
te: కూరగాయలు

# catMeat
source: Meat
hi: मांस
ta: இறைச்சி
te: మాంసం

# catSeafood
source: Seafood
hi: सीफूड
ta: கடல் உணவு
te: సీఫుడ్

# catSpice
source: Spice
hi: मसाला
ta: மசாலா
te: మసాలా

# catDairy
source: Dairy
hi: डेयरी
ta: பால் பொருட்கள்
te: పాల ఉత్పత్తులు

# catGrain
source: Grain
hi: अनाज
ta: தானியம்
te: ధాన్యం

# catOil
source: Oil
hi: तेल
ta: எண்ணெய்
te: నూనె

# catBeverage
source: Beverage
hi: पेय
ta: பானம்
te: పానీయం

# catOther
source: Other
hi: अन्य
ta: மற்றவை
te: ఇతర

source: BOM Management
hi: बीओएम प्रबंधन
ta: BOM நிர்வாகம்
te: BOM నిర్వహణ

# bomInfo
source: Define ingredients required for each dish at 100 pax standard
hi: 100 लोगों के लिए आवश्यक सामग्री
ta: 100 நபர்களுக்கு தேவையான பொருட்கள்
te: 100 మందికి కావలసిన పదార్థాలు

source: Search dishes...
hi: व्यंजन खोजें...
ta: உணவுகளைத் தேடு...
te: డిష్‌లు వెతకండి...

# addDishesHint
source: Add dishes in Menu Management first
hi: पहले मेनू में व्यंजन जोड़ें
ta: முதலில் மெனுவில் உணவுகளைச் சேர்க்கவும்
te: ముందు మెనూలో డిష్‌లు జోడించండి

# itemsCount
source: {count} items
hi: {count} आइटम
ta: {count} உருப்படிகள்
te: {count} అంశాలు

# quantity100Pax
source: Quantity for 100 pax
hi: 100 लोगों के लिए मात्रा
ta: 100 நபர்களுக்கான அளவு
te: 100 మందికి పరిమాణం

source: Select Ingredient
hi: सामग्री चुनें
ta: பொருளைத் தேர்ந்தெடு
te: పదార్థం ఎంచుకోండి

# selectIngredientHint
source: Select ingredient and enter quantity
hi: चुनें और मात्रा दर्ज करें
ta: தேர்ந்தெடுத்து அளவை உள்ளிடு
te: ఎంచుకుని పరిమాణం ఇవ్వండి

# allIngredientsAdded
source: All ingredients already added
hi: सभी जोड़े गए
ta: எல்லாம் சேர்க்கப்பட்டது
te: అన్నీ జోడించబడ్డాయి

source: ✅ Quantity updated
hi: ✅ मात्रा अपडेट की गई
ta: ✅ அளவு புதுப்பிக்கப்பட்டது
te: ✅ పరిమాణం నవీకరించబడింది

source: Ingredient removed
hi: हटा दिया गया
ta: நீக்கப்பட்டது
te: తొలగించబడింది

# pax100
source: 100 PAX
hi: 100 लोग
ta: 100 நபர்
te: 100 మంది

source: No ingredients added
hi: कोई सामग्री नहीं
ta: பொருட்கள் இல்லை
te: పదార్థాలు లేవు

# mrpRunScreenTitle
source: MRP Run
hi: एमआरपी रन
ta: MRP இயக்கம்
te: MRP రన్

source: Change Date
hi: तारीख बदलें
ta: தேதி மாற்று
te: తేదీ మార్చు

source: Live Kitchen
hi: लाइव किचन
ta: லைவ் சமையலறை
te: లైవ్ కిచెన్

source: Subcontracted
hi: सबकांट्रेक्टेड
ta: ஒப்பந்தம்
te: సబ్‌కాంట్రాక్ట్

# noOrdersForDate
source: No orders for selected date
hi: कोई ऑर्डर नहीं
ta: ஆர்டர்கள் இல்லை
te: ఆర్డర్లు లేవు

source: Select Different Date
hi: दूसरी तारीख चुनें
ta: வேறொரு தேதியைத் தேர்ந்தெடு
te: వేరే తేదీ ఎంచుకోండి

source: RUN MRP
hi: एमआरपी चलाएं
ta: MRP இயக்கு
te: MRP రన్ చేయి

source: Calculating...
hi: गणना हो रही है...
ta: கணக்கிடுகிறது...
te: లెక్కిస్తోంది...

source: No orders to process
hi: कोई ऑर्डर नहीं
ta: ஆர்டர்கள் இல்லை
te: ఆర్డర్లు లేవు

source: Venue not specified
hi: स्थान निर्दिष्ट नहीं है
ta: இடம் குறிக்கப்படவில்லை
te: స్థలం పేర్కొనలేదు

source: Select Subcontractor
hi: उपठेकेदार चुनें
ta: ஒப்பந்தக்காரரைத் தேர்ந்தெடு
te: సబ్‌కాంట్రాక్టర్ ఎంచుకోండి

# liveKitchenChip
source: Live Kitchen
hi: लाइव
ta: லைவ்
te: లైవ్

# subcontractChip
source: Subcontract
hi: ठेका
ta: ஒப்பந்தம்
te: కాంట్రాక్ట్

# mrpOutputTitle
source: MRP Output
hi: एमआरपी आउटपुट
ta: MRP வெளியீடு
te: MRP అవుట్‌పుట్

source: No ingredients calculated
hi: गणना नहीं की गई
ta: கணக்கிடப்படவில்லை
te: లెక్కించలేదు

# checkBomDefined
source: Check if dishes have BOM defined
hi: बीओएम की जांच करें
ta: BOM உள்ளதா எனப் பார்
te: BOM ఉందో చూడండి

source: total
hi: कुल
ta: மொத்தம்
te: మొత్తం

source: PROCEED TO ALLOTMENT
hi: आवंटन के लिए आगे बढ़ें
ta: ஒதுக்கீட்டிற்குச் செல்
te: కేటాయింపుకు వెళ్లు

# allotmentTitle
source: Allotment
hi: आवंटन
ta: ஒதுக்கீடு
te: కేటాయింపు

source: Supplier Allotment
hi: आपूर्तिकर्ता आवंटन
ta: விநியோகஸ்தர் ஒதுக்கீடு
te: సరఫరాదారు కేటాయింపు

source: Summary
hi: सारांश
ta: சுருக்கம்
te: సారాంశం

# assignIngredientHint
source: Assign each ingredient to a supplier
hi: आपूर्तिकर्ताओं को असाइन करें
ta: விநியோகஸ்தர்களுக்கு ஒதுக்கவும்
te: సరఫరాదారులకు కేటాయించండి

# assignedStatus
source: {assigned}/{total} assigned
hi: {assigned}/{total} असाइन किया गया
ta: {assigned}/{total} ஒதுக்கப்பட்டது
te: {assigned}/{total} కేటాయించబడింది

source: Supplier
hi: आपूर्तिकर्ता
ta: விநியோகஸ்தர்
te: సరఫరాదారు

# generateAndSendPos
source: GENERATE & SEND POs
hi: पीओ जनरेट करें और भेजें
ta: PO உருவாக்கி அனுப்பு
te: PO సృష్టించి పంపు

# posWillBeGenerated
source: {count} POs will be generated
hi: {count} पीओ जनरेट होंगे
ta: {count} PO உருவாக்கப்படும்
te: {count} PO సృష్టించబడతాయి

# noAllocationsMade
source: No allocations made yet
hi: कोई आवंटन नहीं
ta: ஒதுக்கீடுகள் இல்லை
te: కేటాయింపులు లేవు

# allocateIngredientsFirst
source: Allocate ingredients to suppliers first
hi: पहले आवंटन करें
ta: முதலில் ஒதுக்கீடு செய்
te: ముందు కేటాయించండి

# posGeneratedSuccess
source: ✅ {count} POs generated and sent
hi: ✅ {count} पीओ जनरेट किए गए
ta: ✅ {count} PO உருவாக்கப்பட்டது
te: ✅ {count} PO సృష్టించబడ్డాయి

# catGrocery
source: Grocery
hi: किराना
ta: மளிகை
te: కిరాణా

source: Supplier Master
hi: आपूर्तिकर्ता
ta: விநியோகஸ்தர்கள்
te: సరఫరాదారులు

source: Add Supplier
hi: आपूर्तिकर्ता जोड़ें
ta: விநியோகஸ்தரைச் சேர்
te: సరఫరాదారు జోడించు

source: Edit Supplier
hi: संपादित करें
ta: திருத்து
te: సవరించు

# nameRequired
source: Name *
hi: नाम *
ta: பெயர் *
te: పేరు *

source: Mobile
hi: मोबाइल
ta: மொபைல்
te: మొబైల్

source: GST Number
hi: जीएसटी नंबर
ta: GST எண்
te: GST నంబర్

source: Bank Details
hi: बैंक विवरण
ta: வங்கி விவரங்கள்
te: బ్యాంక్ వివరాలు

source: Enter supplier name
hi: नाम दर्ज करें
ta: பெயரை உள்ளிடு
te: పేరు నమోదు చేయి

source: ✅ Supplier updated
hi: ✅ अपडेट किया गया
ta: ✅ புதுப்பிக்கப்பட்டது
te: ✅ నవీకరించబడింది

source: ✅ Supplier added
hi: ✅ जोड़ा गया
ta: ✅ சேர்க்கப்பட்டது
te: ✅ జోడించబడింది

source: No suppliers added
hi: कोई आपूर्तिकर्ता नहीं
ta: விநியோகஸ்தர்கள் இல்லை
te: సరఫరాదారులు లేరు

source: No phone
hi: फोन नहीं
ta: போன் இல்லை
te: ఫోన్ లేదు

source: Subcontractor Master
hi: उपठेकेदार
ta: துணை ஒப்பந்தக்காரர்கள்
te: సబ్‌కాంట్రాక్టర్లు

source: Edit Subcontractor
hi: संपादित करें
ta: திருத்து
te: సవరించు

source: Add Subcontractor
hi: जोड़ें
ta: சேர்
te: జోడించు

source: Kitchen/Business Name *
hi: नाम *
ta: பெயர் *
te: పేరు *

# mobileRequired
source: Mobile *
hi: मोबाइल *
ta: மொபைல் *
te: మొబైల్ *

source: Specialization
hi: विशेषज्ञता
ta: சிறப்பு
te: స్పెషలైజేషన్

# specializationHint
source: e.g., Biriyani, Chinese, Sweets
hi: उदा. बिरयानी
ta: எ.கா. பிரியாணி
te: ఉదా. బిర్యానీ

source: Rate per Pax (₹)
hi: दर (प्रति व्यक्ति - ₹)
ta: விலை (ஒரு நபர் - ₹)
te: ధర (ఒకరికి - ₹)

# enterNameMobile
source: Enter name and mobile
hi: नाम और नंबर
ta: பெயர் மற்றும் எண்
te: పేరు మరియు నంబర్

source: ✅ Subcontractor updated
hi: ✅ अपडेट किया गया
ta: ✅ புதுப்பிக்கப்பட்டது
te: ✅ నవీకరించబడింది

source: ✅ Subcontractor added
hi: ✅ जोड़ा गया
ta: ✅ சேர்க்கப்பட்டது
te: ✅ జోడించబడింది

source: No subcontractors added
hi: कोई नहीं
ta: யாரும் இல்லை
te: ఎవరూ లేరు

source: per pax
hi: प्रति व्यक्ति
ta: ஒரு நபர்
te: ఒకరికి

# purchaseOrdersTitle
source: Purchase Orders
hi: खरीद आदेश
ta: கொள்முதல் ஆர்டர்கள்
te: కొనుగోలు ఆర్డర్లు

# statusSent
source: SENT
hi: भेजा गया
ta: அனுப்பப்பட்டது
te: పంపబడింది

# statusViewed
source: VIEWED
hi: देखा गया
ta: பார்க்கப்பட்டது
te: చూశారు

# statusAccepted
source: ACCEPTED
hi: स्वीकार किया गया
ta: ஏற்கப்பட்டது
te: అంగీకరించబడింది

# purchaseOrdersCount
source: {count} purchase orders
hi: {count} खरीद आदेश
ta: {count} கொள்முதல் ஆர்டர்கள்
te: {count} కొనుగోలు ఆర్డర్లు

source: No purchase orders
hi: कोई नहीं
ta: இல்லை
te: లేవు

# runMrpHint
source: Run MRP to generate POs
hi: पीओ पाने के लिए एमआरपी चलाएं
ta: PO பெற MRP இயக்கு
te: PO పొందడానికి MRP రన్ చేయి

# dispatchTitle
source: Dispatch
hi: डिस्पैच
ta: அனுப்புதல்
te: డిస్పాచ్

# tabList
source: List
hi: सूची
ta: பட்டியல்
te: జాబితా

# tabActive
source: Active
hi: सक्रिय
ta: செயலில்
te: యాక్టివ్

# tabReturns
source: Returns
hi: वापसी
ta: திரும்பியவை
te: రిటర్న్స్

# tabUnload
source: Unload
hi: उतारना
ta: இறக்குதல்
te: అన్‌లోడ్

# noPendingOrdersDate
source: No pending orders for {date}
hi: कोई लंबित ऑर्डर नहीं
ta: நிலுவை ஆர்டர்கள் இல்லை
te: పెండింగ్ ఆర్డర్లు లేవు

source: No active dispatches
hi: सक्रिय नहीं
ta: செயலில் இல்லை
te: యాక్టివ్ లేదు

# noReturnTracking
source: No items for return tracking
hi: नहीं
ta: இல்லை
te: లేదు

# noUnloadItems
source: No items ready for unload
hi: उतारने के लिए कुछ नहीं
ta: இறக்க எதுவுமில்லை
te: అన్‌లోడ్ చేయడానికి ఏమీ లేదు

source: Start Dispatch
hi: शुरू करें
ta: தொடங்கு
te: ప్రారంభించు

source: Waiting for Kitchen
hi: रसोई का इंतजार
ta: சமையலறைக்காகக் காத்திருப்பு
te: కిచెన్ కోసం వేచి ఉంది

source: Track
hi: ट्रैक
ta: கண்காணி
te: ట్రాక్

source: Verify
hi: सत्यापित करें
ta: சரிபார்
te: ధృవీకరించు

# kitchenItemsSubtitle
source: Prepared in kitchen - tick when loaded
hi: Prepared in kitchen
ta: Prepared in kitchen
te: Prepared in kitchen

# subcontractItemsSubtitle
source: Optional - may come directly to venue
hi: Direct to venue
ta: Direct to venue
te: Direct to venue

# liveCookingItemsSubtitle
source: Load ingredients for on-site cooking
hi: On-site cooking
ta: On-site cooking
te: On-site cooking

source: Today
hi: आज
ta: இன்று
